[Dismantle_SMG_M1 X2TechTemplate]
DisplayName="Разобрать ПП \"Адвента\""
Summary="Мы нашли этот ПП во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия."
CodeName="Стервятник"
LongDescription="После разборки ПП, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. К сожалению, из-за простоты технологий, использованных для создания этого оружия, было невозможно извлечь компоненты улучшения."
UnlockedDescription="После разборки ПП получено: 10 Фрагментов Лёгкого Оружия"

[Dismantle_SMG_M2 X2TechTemplate]
DisplayName="Разобрать Продвинутый ПП"
Summary="Мы нашли этот ПП во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки ПП, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 2 уровня."
UnlockedDescription="После разборки ПП получено: 1 Компонент Улучшения 2 уровня, 12 Фрагментов Лёгкого Оружия"

[Dismantle_SMG_M3 X2TechTemplate]
DisplayName="Разобрать Элитный ПП"
Summary="Мы нашли этот ПП во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки ПП, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 3 уровня."
UnlockedDescription="После разборки ПП получено: 1 Компонент Улучшения 3 уровня, 15 Фрагментов Лёгкого Оружия"

[Dismantle_Flammenwerfer_M1 X2TechTemplate]
DisplayName="Разобрать Огнебой \"Адвента\""
Summary="Мы нашли этот дробовик во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия."
CodeName="Стервятник"
LongDescription="После разборки дробовика, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. К сожалению, из-за простоты технологий, использованных для создания этого оружия, было невозможно извлечь компоненты улучшения."
UnlockedDescription="После разборки дробовика получено: 10 Фрагментов Лёгкого Оружия"

[Dismantle_Flammenwerfer_M2 X2TechTemplate]
DisplayName="Разобрать Продвинутый Огнебой"
Summary="Мы нашли этот дробовик во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки дробовика, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 2 уровня."
UnlockedDescription="После разборки дробовика получено: 1 Компонент Улучшения 2 уровня, 12 Фрагментов Лёгкого Оружия"

[Dismantle_Flammenwerfer_M3 X2TechTemplate]
DisplayName="Разобрать Элитный Огнебой"
Summary="Мы нашли этот дробовик во время одной из операций. В случае ненадобности его можно разобрать на Фрагменты Лёгкого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки дробовика, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 3 уровня."
UnlockedDescription="После разборки дробовика получено: 1 Компонент Улучшения 3 уровня, 15 Фрагментов Лёгкого Оружия"

[Dismantle_Smartgun_M1 X2TechTemplate]
DisplayName="Разобрать Смартган \"Адвента\""
Summary="Мы нашли эту пушку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия."
CodeName="Стервятник"
LongDescription="После разборки пушки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. К сожалению, из-за простоты технологий, использованных для создания этого оружия, было невозможно извлечь компоненты улучшения."
UnlockedDescription="После разборки пушки получено: 10 Фрагментов Тяжёлого Оружия"

[Dismantle_Smartgun_M2 X2TechTemplate]
DisplayName="Разобрать Продвинутый Смартган"
Summary="Мы нашли эту пушку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки пушки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 2 уровня."
UnlockedDescription="После разборки пушки получено: 1 Компонент Улучшения 2 уровня, 12 Фрагментов Тяжёлого Оружия"

[Dismantle_Smartgun_M3 X2TechTemplate]
DisplayName="Разобрать Элитный Смартган"
Summary="Мы нашли эту пушку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки пушки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 3 уровня."
UnlockedDescription="После разборки пушки получено: 1 Компонент Улучшения 3 уровня, 15 Фрагментов Тяжёлого Оружия"

[Dismantle_Scoutrifle_M1 X2TechTemplate]
DisplayName="Разобрать Разведвинтовку \"Адвента\""
Summary="Мы нашли эту снайперскую винтовку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия."
CodeName="Стервятник"
LongDescription="После разборки снайперской винтовки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. К сожалению, из-за простоты технологий, использованных для создания этого оружия, было невозможно извлечь компоненты улучшения."
UnlockedDescription="После разборки снайперской винтовки получено: 10 Фрагментов Тяжёлого Оружия"

[Dismantle_Scoutrifle_M2 X2TechTemplate]
DisplayName="Разобрать Продвинутую Разведвинтовку"
Summary="Мы нашли эту снайперскую винтовку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки снайперской винтовки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 2 уровня."
UnlockedDescription="После разборки снайперской винтовки получено: 1 Компонент Улучшения 2 уровня, 12 Фрагментов Тяжёлого Оружия"

[Dismantle_Scoutrifle_M3 X2TechTemplate]
DisplayName="Разобрать Элитную Разведвинтовку"
Summary="Мы нашли эту снайперскую винтовку во время одной из операций. В случае ненадобности её можно разобрать на Фрагменты Тяжёлого Оружия и компоненты улучшения."
CodeName="Стервятник"
LongDescription="После разборки снайперской винтовки, мы получили набор фрагментов оружия, которые можно использовать в других оружейных проектах. Также мы смогли получить компонент улучшения 3 уровня."
UnlockedDescription="После разборки снайперской винтовки получено: 1 Компонент Улучшения 3 уровня, 15 Фрагментов Тяжёлого Оружия"

[Manufacture_UC2 X2TechTemplate]
DisplayName="Произвести Компонент Улучшения 2 уровня"
Summary="В случае нехватки Компонентов Улучшения, мы можем потратить Ядро Элерия на создание своих. Из одного Ядра можно получить два Компонента."
CodeName="Гиена"
LongDescription="Ядра Элерия - довольно гибкие штуки. Слегка модифицировав одно из них, мы создали несколько Компонентов Улучшения для наших военных разработок."
UnlockedDescription="Создано 2 Компонента Улучшения 2 уровня"

[Manufacture_UC3 X2TechTemplate]
DisplayName="Произвести Компонент Улучшения 3 уровня"
Summary="В случае нехватки Компонентов Улучшения, мы можем потратить Ядро Элерия на создание своих. Из одного Ядра можно получить два Компонента."
CodeName="Гиена"
LongDescription="Ядра Элерия - довольно гибкие штуки. Слегка модифицировав одно из них, мы создали несколько Компонентов Улучшения для наших военных разработок."
UnlockedDescription="Создано 2 Компонента Улучшения 3 уровня"

[LaserWeapons X2TechTemplate]
DisplayName="Laser Weapons"
Summary="We could try to put effort towards a precise weapon technology. We wouldn't be able to massproduce them, but the option to produce singletons could prove worthwhile."
CodeName="Prometheus"
LongDescription="Exploiting the unique properties of elerium batteries used in alien weapons, we found a new way of using this energy for a weapon technology. Focusing the energy, we can create a beam of energy that transmits heat at a focal point to a degree where it can pierce through most conventional armor and cause tissue damage at the intended target. These weapons are more accurate than projectile based weaponry because they don't have to deal with external factors like falloff due to gravity. The energy support for these weapons needs to be engineered to precision which makes them prohibitively expensive, we likely won't be able to massproduce them ever. R. Tygan.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>Lasers are one of two alternative tier 2 weapon techs. They are roughly on par with Magnetic weapons, with the following differences:<br/>- Lasers are more accurate thanks to an innate aim bonus.<br/>- Lasers are predictable and reliable, having narrow damage ranges.<br/>- On the other hand, Lasers get penalties to their crit chance and damage. <br/>- Lasers pierce one point of armor.<br/>- There is a Laser version for each of the four primary weapon types.<br/><br/>Unlike Magnetic weapons, Laser and Coil weapons are built individually. Make sure to not spend all your fragments on these if you want to eventually upgrade to Magnetic, too. And you will need to upgrade eventually to unlock more techs and to upgrade your secondary weapons.</font>"
UnlockedDescription="Laser Weapons now available at the Workshop"

[CoilWeapons X2TechTemplate]
DisplayName="Coil Weapons"
Summary="An approach to more impactful weaponry based on hyper-accelerated projectiles. We wouldn't be able to massproduce them, but the option to produce singletons could prove worthwhile."
CodeName="Atlas"
LongDescription="A theory the military of earth has been working on for years, these coil guns are supposed to be capable to accelerate projectiles with even more speeds and force than any other conventional weapon in use until now. We have been able to confirm these theories now and are able to produce some of these weapons on your orders, Commander. Coil Guns should prove to have devastating effects on anything that they hit. However, due to the brute force approach to them, their accuracy is a bit on the weak side. Due to their highly experimental status and dependancy on some of the more durable alien materials we won't be able to build these in high numbers. R. Tygan.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>Coil weapons are one of two alternative tier 2 weapon techs. They are roughly on par with Magnetic weapons, with the following differences:<br/>- Coilguns are less accurate and get an innate aim penalty.<br/>- Coilguns are unpredictable, with wide damage ranges offering potentially devastating damage even before crits, but also the potential to just scratch the enemy.<br/>- These weapons have good crit chances and damage, further playing into their potential to unequaled impact. <br/>- Coil Weapons shred one point of armor.<br/>- There is a Coil version for each of the four primary weapon types.<br/><br/>Unlike Magnetic weapons, Laser and Coil weapons are built individually. Make sure to not spend all your fragments on these if you want to eventually upgrade to Magnetic, too. And you will need to upgrade eventually to unlock more techs and to upgrade your secondary weapons.</font>"
UnlockedDescription="Coil Weapons now available at the Workshop"

[PulseWeapons X2TechTemplate]
DisplayName="Pulse Weapons"
Summary="We can improve on our existing Laser technology, increasing impact and accuracy."
CodeName="Lucifer"
LongDescription="Experiments with our laser weapons led, almost by accident, to a breakthrough. Originally a malfunctioning energy source dramatically improved all the desirable attributes of a laser weapon in the field. Our research team believes it is now able to replicate this malfunction in a controlled manner, allowing us to put the attached weapon into a supercharged state. Of course, these improvements make the weapons even more expensive to manufacture, but i suppose that is preferable to having them explode in the field.  R. Tygan.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>Pulselasers are the improved version of Lasers and one of two alternative tier 3 weapon techs. They are roughly on par with Beam weapons, with the following differences:<br/>- Pulselasers are even more accurate than Lasers, with a sizeable aim bonus.<br/>- Like basic Lasers, they are predictable and reliable, having narrow damage ranges.<br/>- On the other hand, their penalties to crit chance and damage also increase. <br/>- Pulseweapons pierce two points of armor.<br/>- There is a Pulse version for each of the four primary weapon types.<br/><br/>Of course, these are also built individually.</font>"
UnlockedDescription="Pulse Weapons now available at the Workshop"

[RailWeapons X2TechTemplate]
DisplayName="Rail Weapons"
Summary="We can improve on our existing Coil technology, increasing impact and damage potential."
CodeName="Vulcan"
LongDescription="Many of the things we learned from the development of Magnetic weaponry can be translated towards improvements of our Coil technology. Early prototypes have shown these weapons to have a somewhat unreliable, but potentially devastating effect on single targets. The staff has noted the similarities of our project to decades old technology that needed to be installed on warships due to its size and begun to call them Railguns as a nod towards those. Of course, due to the advancements we were able to win out of our continuing conflict with the alien invaders, our railguns need no such support and can be fully handheld. I can't help but marvel at how much progress we were able to make in these last years, i just wish it was in different areas than military.  R. Tygan. <br/><br/><font color='#1889ba'>A Better Barracks:<br/>The improved version of Coil weapons, these Railguns are one of two alternative tier 3 weapon techs. They are roughly on par with Beam weapons, with the following differences:<br/>- Railguns are even less accurate, with a hefty aim penalty innate to all of them.<br/>- Railguns have even wider damage ranges.<br/>- Of course, their crit damage and chance is also increased. A Rail Weapon that connects can cause unparalleled damage.<br/>- Railguns shred two points of armor.<br/>- There is a Rail version for each of the four primary weapon types.<br/><br/>Of course, these are also built individually.</font>"
UnlockedDescription="Rail Weapons now available at the Workshop"

[ChoosePsiVanilla X2TechTemplate]
DisplayName="Switch to Vanilla Psi"
Summary="+++ READ THIS! +++ <br/>If you click this, you can not undo it! <br/><br/> If you research this, you discard the changes to the psi system done by A Better Barracks and go with the vanilla system instead. <br/><br/>Reminder/Summary: <br/> Vanilla: Build Psi Chamber, train Psi Operatives with random psi perks. Use psi amps in secondary slot. <br/><br/> ABB: There's no Psi Chamber. Instead you unlock Psi Amps with Sectoid and Priest autopsy. Any soldier can use psi amps. Different psi amps exist that give access to different perks. Psi perks have feedback that causes damage to user but can be counteracted by use of Psi Armors that are unlocked with the Psionics research. <br/><br/> If you want to discard this option from your research screen, use the Confirm ABB Psi option below."
CodeName="Jake"
LongDescription="Vanilla Psi re-enabled. ABB Psi disabled."
UnlockedDescription="Vanilla Psi now available."

[DiscardPsiVanilla X2TechTemplate]
DisplayName="Confirm ABB Psi"
Summary="Discards the vanilla Psi system permanently, confirming the choice of ABB psi system. For details see the Switch to Vanilla Psi option."
CodeName="Ascension"
LongDescription="Vanilla Psi disabled."
UnlockedDescription="Switch to Vanilla Psi no longer available."

[ModularWeapons X2TechTemplate]
LongDescription="We've had the troops digging through scrap piles and looting corpses, and at this point, it's safe to assume they're on constant vigil for anything we could use to improve our gear. All the raw materials in the world won't mean much if I can't find a use for them, but I think this modular weapon system is a good start. Having pushed our existing designs about as far as I thought possible, the integration of a few key alien components provided the much needed stability we've been looking for. With these modifications in place, we should be able to attach larger upgrades for even more firepower. The troops will like that. L. Shen.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>ABB changes the mechanics of the primary weapons to give each one of them a more distict feel. <br/>- Assault Rifle: Most like the vanilla version. Fires for one action, reloads for one action. Starts with 2 upgrade slots.<br/>- Shotgun: Very high damage and crit, with a cumbersome reload mechanic. Fires for one action. Reloads ONE SHELL for one action. Starts with 1 upgrade slot. Provides the Deep Cover perk, which can be used to reload in safety or to take point.<br/>- Cannon: Heavy weapon with lots of ammo but little mobility. Fires for two actions. Reloads for two actions. Using the Spray ability, can fire at an aim penalty for only one action, even multiple times per turn. Has 9 ammo. High environmental damage. Starts without upgrade slots.<br/>- Sniper Rifle: Heavy Weapon. High damage at long range. Fires for two actions. Reloads for one action. Provides Squad Sight.<br/><br/>Every soldier class is able to use two different primary weapons, one light and one heavy.<br/>Other weapons built by XCOM, like Coilguns and Pulselasers, follow the same basic rules for primary weapons.<br/>Rumor has it that completely different primary weapons are available as loot from ADVENT. If true, those would be likely to get at supply and UFO raids.</font>"

[Psionics X2TechTemplate]
LongDescription="By closely examining the aliens' own means of harnessing and wielding Psionic energy, I believe the chances are good that we'll have more than enough viable candidates to serve as Psi Operatives. However, with the advanced Psionic capabilities we've seen from the various alien species in the field, it may not be enough. In preparation for this new class of soldiers, I've used the chip removed from the Commander to study the technology needed to focus and divert Psionic energy. As a result, I've developed a Psionic amplifier capable of focusing and enhancing the Psionic energy they will be trained to harness. Although the potential for negative side effects will be high, I foresee the possibility that our soldiers will be able to push their new powers beyond the limits of what we might consider safe. R. Tygan.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>If you chose to use the ABB Psi system, you will get the following changes:<br/>- There is no Psi Chamber and there is no Psi Operative.<br/>- Psi abilities are acquired by equipping one of your soldiers with a psi amp.<br/>- Psi Amps can be built after doing the autopsies for Sectoid or Priest.<br/>- There are different types of Amp, giving access to different abilities. <br/>- The use of psi amps will lead to feedback damage to the user. <br/>- This feedback damage can be counteracted by building and equipping psi armors. <br/>- To get psi armors, you need to have at least Predator armor. <br/>- Upgrade your amps by researching Elerium, Battlefield Medicine and Gatekeeper Autopsy.</font>"

[HybridMaterials X2TechTemplate]
LongDescription="With limited resources available to outfit our troops, up until now they've had to make do with whatever makeshift armor Shen managed to piece together for them from various scrap materials. Relying on methods that might otherwise seem outdated, we've developed a means of producing a multilayered nanofiber weave capable of withstanding direct impacts as well as any traditional armor, without the added weight. Our troops will still have to exercise caution; even the nanofiber has its limits - it may be best suited to our forces who rely on agility over pure stopping power. In any case, I imagine our soldiers will be pleased to see any improvements over their current equipment. R. Tygan.<br/><br/><font color='#1889ba'>A Better Barracks:<br/>There are several changes to how some of the items used by XCOM work. Here are some of the immediately important ones:<br/>- The basic Frag Grenade has been split up into two specialized grenades. The High Explosive Grenade deals little damage, but is sure to destroy any cover in its blast radius. Also, it shreds armor. Its' counterpart, the Flechette Grenade, deals high damage and pierces armor. However, it won't damage the environment at all.<br/>- The basic Medikit is available in unlimited quantities from the beginning.<br/>- You can build the Traumakit. Traumakits have a special form of Medkitheal, the Medic Sprint. Medic Sprint allows to dash to a target and heal it, however the carrier can't heal himself with it. Traumakits also allow the user to raise unconscious soldiers back to their feet.<br/>- Civilian Disguises are vest type items that offer Phantom.<br/>- Travel Light is an option to increase movementspeed instead of carrying an item in that slot. <br/>- There are several other new items in the mod, you'll discover them as you go.<br/><br/>You will also see that some of the weapon attachments are changed. Stocks provide aim now, but only when you use both actions to shoot. Scopes provide armor pierce and stop enemies from dodging. Repeaters offer crit damage.</font>" 
